Tekla Open API Reference for Tekla Structures 2025
Matrix Properties
The Matrix type exposes the following members.
Properties
Name | Description
Item
 Sets or gets the matrix element values.
Top
See Also
Reference
Matrix Class
Tekla.Structures.Geometry3d Namespace